app/controllers/courses_controller.rb

    def index
        if params[:search]
            @courses = Course.search(params[:search]).paginate(:page => params[:page], :per_page => 5)
---
SELECT "courses".* FROM "courses"

    def create
      authorize! :create, @user, :message => 'Not authorized as an administrator.'
        @course = Course.new(params[:course])

        respond_to do |format|
            if @course.save
---
INSERT INTO "courses" ("cost", "created_at", "description", "media_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def update
      authorize! :update, @user, :message => 'Not authorized as an administrator.'
        @course = Course.find(params[:id])

        respond_to do |format|
            if @course.update_attributes(params[:course])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "courses" SET "description" = 'this is a test course to see how the functionality in this new sites works. hopefully it will work well!! :)', "updated_at" = '2013-08-23 19:23:14.005187' WHERE "courses"."id" = 2