app/controllers/enrolls_controller.rb

SELECT "courses".* FROM "courses"
SELECT "users".* FROM "users"
SELECT "enrolls".* FROM "enrolls"
---
  def index
      @course = Course.all
      @user = User.all
    @enrolls = Enroll.all

SELECT "courses".* FROM "courses"
SELECT "enrolls".* FROM "enrolls" WHERE "enrolls"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
      @course = Course.all
    @enroll = Enroll.find(params[:id])

INSERT INTO "enrolls" ("course_id", "created_at", "expiration", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["course_id", nil], ["created_at", Fri, 23 Aug 2013 20:37:22 UTC +00:00], ["expiration", nil], ["updated_at", Fri, 23 Aug 2013 20:37:22 UTC +00:00], ["user_id", nil]]
---
  def create
    @enroll = Enroll.new(params[:enroll])

    respond_to do |format|
      if @enroll.save