app/controllers/orders_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
---
    def new
        @course = Course.find(params[:course_id])

INSERT INTO "orders" ("course_id", "created_at", "expiration", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["course_id", 1], ["created_at", Thu, 22 Aug 2013 05:47:36 UTC +00:00], ["expiration", nil], ["updated_at", Thu, 22 Aug 2013 05:47:36 UTC +00:00], ["user_id", 1]]
---
    def create

        @order = Order.new(params[:order])
        if @order.save_with_payment