app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    authorize! :index, @user, :message => 'Not authorized as an administrator.'
    @users = User.paginate(:page => params[:page], :per_page => 5)

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def destroy
    authorize! :destroy, @user, :message => 'Not authorized as an administrator.'
    user = User.find(params[:id])